#ifndef __UFS_H__
#define __UFS_H__

#include <common.h>
#include <linux/io.h>

typedef u32 ULONG;
typedef u16 USHORT;
typedef u8 UCHAR;
typedef u32 BOOL;
typedef u32 UINT;
typedef signed int s32;

#define UFS_DEBUG
/*#define UFS_MEM_DEBUG*/

/*#define UFS_FPGA */
#define COMBO_PHY_V120

/*-----------------------------------------------------------------
 * FMC register
------------------------------------------------------------------ */
#define FMC_MEM_CTRL		0x100000b4

/*-----------------------------------------------------------------
 *serial base address and clock
------------------------------------------------------------------ */

#ifndef UFS_FPGA
#define REG_BASE_UFS_ADDRESS 0x10010000
#else
#define REG_BASE_UFS_ADDRESS 0x113a0000
#endif

#ifdef UFS_FPGA
#define REG_BASE_FPGA2_APB_IF_ADDRESS 0x113f7000
#define UFS_SRST_REQ	(0x1 << 0)
#define UFS_RST			(0x1 << 31)
#endif

#define TRUE    1
#define FALSE   0


#define MAX_DEVICE  64

#define SUCCESS 0
#define ERROR   (-1)

#define UFS_ERROR -1
#define UFS_OK   0
#define UFS_DATA_DIFF 0x2
#define UFS_GLITCH_BYPASS 0x3

/* use the below MACRO to define pressure test characteristc */
/*#define PRESSURE_REINIT*/
#define PRESSURE_PMC
#define PRESSURE_RW
/*#define PRESSURE_H8*/
#define CLOSE_CLK_GATING
/*#define USE_GPIO_TO_CAPTURE*/

#define H8_DELAY 1

/*#define OCS_5_WORKAROUND*/
#if defined(OCS_5_WORKAROUND)
#define NOISE_PROOF
#endif

#define CONTROLLER_OFFSET_TO_SRAM  (0xE0000000)
#define SRAM_PHY_BASE_ADDR  0


#define DWC_UFS_UTMSE                       0x00000008
#define DWC_UFS_UPMSE                       0x00000010
#define DWC_UFS_UHXSE                       0x00000020
#define DWC_UFS_UHESE                       0x00000040
#define DWC_UFS_ULLSE                       0x00000080
#define DWC_UFS_ULSSE                       0x00000100
#define DWC_UFS_UTMRCE                      0x00000200
#define DWC_UFS_UCCE                        0x00000400
#define DWC_UFS_DFEE                        0x00000800
#define DWC_UFS_UTPEE                       0x00001000
#define DWC_UFS_HCFEE                       0x00010000
#define DWC_UFS_SBFEE                       0x00020000

/* DWC_UFS_REG_UTRIACR Bitfields and masks and shift value */
#define DWC_UFS_IAEN                        0x80000000
#define DWC_UFS_IAPWEN                      0x01000000
#define DWC_UFS_IASB                        0x00100000
#define DWC_UFS_CTR                         0x00010000
#define DWC_UFS_IACTH_MASK                  0x00001f00
#define DWC_UFS_IACTH_SH                    8
#define DWC_UFS_IATOVAL_MASK                0x000000ff


#define MTX_L0	0x0000	/*GenSelectorIndex for TX lane 0*/
#define MTX_L1	0x0001	/*GenSelectorIndex for TX lane 1*/
#define MRX_L0	0x0004  /*GenSelectorIndex for RX lane 0*/
#define MRX_L1	0x0005  /*GenSelectorIndex for RX lane 1*/

#define ATTR_M_SHIFT			16
#define ATTR_UNIPRO_SHIFT		ATTR_M_SHIFT

#define ATTR_MTX0(x)	((x << ATTR_M_SHIFT) | MTX_L0)
#define ATTR_MTX1(x)	((x << ATTR_M_SHIFT) | MTX_L1)
#define ATTR_MRX0(x)	((x << ATTR_M_SHIFT) | MRX_L0)
#define ATTR_MRX1(x)	((x << ATTR_M_SHIFT) | MRX_L1)
#define ATTR_MCB(x)		((u32)((u16)(x) << ATTR_M_SHIFT))
#define ATTR_UNIPRO(x)	((u32)((u16)(x) << ATTR_UNIPRO_SHIFT))
/*SYNOPSYS UniPro register*/
#define UNIPRO_DME_RESET		0xD010
#define UNIPRO_DME_LAYBER_ENABLE	0xD000
/*MPHY registers addr*/
/*RX*/
#define AD_DIF_P_LS_TIMEOUT_VAL		0x0003
#define PWM_PREPARE_TO			0x00000080
#define SKP_DET_SEL			0x0009
#define SKP_DET_SEL_EN			0x00000001

#define MRX_EN				0x00F0
#define MRX_ENABLE			(0x01 << 0)
#define RX_SQ_VREF			0x00F1
#define RX_SQ_VREF_175mv		0x00000002
#define VCO_AUTO_CHG			0x00DF
#define VCO_AUTO_CHG_EN			(0x01 << 0)
#define VCO_FORCE_ON_EN			(0x01 << 1)

#define RG_PLL_PRE_DIV			0x00C2
#define RG_PLL_PRE_DIV_1		0x00
#define RG_PLL_PRE_DIV_2		0x01
#define RG_PLL_PRE_DIV_4		0x02
#define RG_PLL_PRE_DIV_8		0x03

#define RG_PLL_FBK_P			0x00C3
#define RG_PLL_FBK_S			0x00C4

#define RG_PLL_SWC_EN			0x00C9
#define PG_PLL_SWC_ENABLE		0x01

#define RG_PLL_RXHSGR			0x00CD
#define RG_PLL_RXLSGR			0x00CE
#define RG_PLL_TXHSGR			0x00CF
#define HS_R_A_FBK_P			0x41
#define HS_R_B_FBK_P			0x4C
#define HS_G_1_TXRXHSGR			0x02
#define HS_G_2_TXRXHSGR			0x01
#define HS_G_3_TXRXHSGR			0x00

#define RG_PLL_TXLSGR			0x00D0

/*PHY CB*/
#define RG_PLL_TXHS_EN			0x00C7
#define RG_PLL_TXHS_ENANBLE		(0x01 << 0)
#define RG_PLL_TXHS_EN_CONTROL		(0x01 << 1)

#define RG_PLL_TXLS_EN			0x00C8
#define RG_PLL_TXLS_ENABLE		(0x01 << 0)
#define RG_PLL_TXLS_EN_CONTROL		(0x01 << 1)

struct pllChkInfo {
	uint32_t	reg_addr;
	int		bit_mask;
	int		expect_val;
	char	*string;
};


enum {
	RG_PLL_PRE_DIV_INDEX = 0,
	RG_PLL_SWC_EN_INDEX,
	RG_PLL_FBK_S_INDEX,
	RG_PLL_FBK_P_INDEX,
	RG_PLL_TXHSGR_INDEX,
	RG_PLL_RXHSGR_INDEX,
	RG_PLL_END_INDEX
};

/* Interrupt configuration options */
enum {
	DWC_UFS_HCD_INTR_DISABLE = 0,
	DWC_UFS_HCD_INTR_ENABLE = 1,
};

/* Interrupt aggregation options */
enum {
	INTR_AGGR_RESET,
	INTR_AGGR_CONFIG,
	INTR_AGGR_DISABLE
};

#define DWC_INTR_AGGR_COUNTER_THRESHOLD_VALUE	(0x1F)
#define DWC_INTR_AGGR_TIMEOUT_VALUE		(0xFF)
#define BAD_SLOT  0x55
enum tm_task_resp {
	TM_COMPLETE = 0x00,
	TM_NOT_SUPPORT = 0x04,
	TM_FAILED = 0x05,
	TM_SUCCESS = 0x08,
	TM_BAD_LUN = 0x09
};

/* TX_FSM_STATE */
enum {
	M_TX_IDLE = 0x0,
	M_TX_DISABLE = 0x0,
	M_TX_HIBERN8 = 0x1,
	M_TX_HIBERN8_EXIT = 0x1,
	M_TX_Sleep = 0x2,
	M_TX_STALL = 0x3,
	M_TX_LS_BURST = 0x4,
	M_TX_HS_BURST = 0x5,
	M_TX_LINE_CFG = 0x6,
	M_TX_LINE_RESET = 0x7
};

#define HIBERNATE_TIMER_VALUE_MASK (~(BIT(9)))
#define HIBERNATE_TIMER_SCALE_SHIFT (10)
#define CGE   (BIT(12))
#define LP_AH8_PGE   (BIT(17))
#define LP_PGE	(BIT(16))
#define ULP_ULP_CTRLMODE (BIT(3))
/*
 * Register Fields
 */
#define UFS_AUTO_HIBERNATE_BIT	BIT(23)
#define UFS_CAPS_64AS_BIT		BIT(24)
#define UFS_HCE_RESET_BIT		BIT(0)
#define UFS_HCS_DP_BIT			BIT(0)
#define UFS_HCS_UCRDY_BIT		BIT(3)
#define UFS_HCS_UPMCRS_OFF		(8)
#define UFS_HCS_UPMCRS_MASK		(0x3 << UFS_HCS_UPMCRS_OFF)
#define UFS_IS_UE_BIT			BIT(2)
#define UFS_IS_UPMS_BIT			BIT(4)
#define UFS_IS_UHXS_BIT			BIT(5)
#define UFS_IS_UHES_BIT			BIT(6)
#define UFS_IS_ULSS_BIT			BIT(8)
#define UFS_IS_UCCS_BIT			BIT(10)
#define UFS_UTP_RUN_BIT			BIT(0)
#define UFS_LBMCFG_DEFAULT_VALUE	0xb01
#define UFS_HCLKDIV_NORMAL_VALUE	0xFA
#define UFS_HCLKDIV_SLOW_VALUE		0x14
#define UFS_HCLKDIV_FPGA_VALUE		0x28

#define UFS_AHIT_AH8ITV_MASK		(0x3FF)
#define UFS_AHIT_AUTOH8_TIMER		(0x1001)

#define UIC_LINK_STARTUP_CMD		0x16
#define NOP_TRANS_TYPE			0x20

#define LOWER_32_BITS(x)	((uint32_t)((uint64_t)(x) & 0xFFFFFFFFUL))
#define UPPER_32_BITS(x)	((uint32_t)((uint64_t)(x) >> 32))

#define CMD_DESC_ALIGNMENT     128
#define ALIGN_SIZE             1024
#define PRDT_BUFFER_SIZE       0x40000
#define CAPCITY_ADJ_FACTOR     1
#define UNIT_DESCS_COUNT       8
#define SENSE_KEY_INDEX        36
#define RPMB_DATA_SIZE         256
#define RPMB_FRAME_SIZE        512
#define LOGICAL_BLK_SIZE       4096


#define TM_TASK_TEST_NUM       7

#define QUERY_DESC_MANUFACTURER_NAME_MAX_SIZE 0x12
#define QUERY_DESC_PRODUCT_NAME_MAX_SIZE 0x22

/* Data structure sizes in bytes */
enum {
	DWC_UFS_BASIC_UPIU_SIZE = 32,
	DWC_UFS_UTRD_SIZE = 32,
	DWC_UFS_TSF_SIZE = 16,
	DWC_UFS_PRD_SIZE = 16,

	DWC_UFSHCD_MAX_PRD_SIZE = 8,	/* 128 (Linux) */

	DWC_MAX_QUERY_DATA = 256,
	DWC_UFS_CDB_SIZE = 16,
	DWC_UFS_SENSE_DATA_SIZE = 18,

	DWC_UFS_UTMRD_HDR_SIZE = 16,
};

/* Alignment Requirement in bytes */
enum {
	DWC_UTRL_BASE_ALIGN = 1024,
	DWC_UCD_ALIGN = 512,
};

#define FAST_MAX_GEAR 4
#define SLOW_MAX_GEAR 2
#define FAST_MAX_RATE 3
#define SLOW_MAX_RATE 2

/* Rate */
enum UFS_RATE {
	UFS_RATE_A = 1,
	UFS_RATE_B = 2
};

/* POWER mode */
enum POWER_MODE {
	FAST_MODE = 0x11,
	SLOW_MODE = 0x22,
	FASTAUTO_MODE = 0x44,
	SLOWAUTO_MODE = 0x55,
	INVALID_MODE = 0xFF
};

enum ufs_pwm_gear_tag {
	UFS_PWM_DONT_CHANGE,/* Don't change Gear */
	UFS_PWM_G1,/* PWM Gear 1 (default for reset) */
	UFS_PWM_G2,/* PWM Gear 2 */
	UFS_PWM_G3,/* PWM Gear 3 */
	UFS_PWM_G4,/* PWM Gear 4 */
	UFS_PWM_G5,/* PWM Gear 5 */
	UFS_PWM_G6,/* PWM Gear 6 */
	UFS_PWM_G7,/* PWM Gear 7 */
};

enum ufs_hs_gear_tag {
	UFS_HS_DONT_CHANGE,/* Don't change Gear */
	UFS_HS_G1,/* HS Gear 1 (default for reset) */
	UFS_HS_G2,/* HS Gear 2 */
	UFS_HS_G3,/* HS Gear 3 */
};

enum unit_desc_type{
	UNIT_DESC_0 = 0X00,
	UNIT_DESC_1,
	UNIT_DESC_2,
	UNIT_DESC_3,
	UNIT_DESC_4,
	UNIT_DESC_5,
	UNIT_DESC_6,
	UNIT_DESC_7,
	UNIT_DESC_MAX,
};
/* power mode specific define */
struct pwrModeParams {
	uint8_t txGear;
	uint8_t rxGear;
	uint8_t hsSeries;
	uint8_t txLanes;
	uint8_t rxLanes;
	uint8_t pwrMode;
};

struct st_register_dump {
	uint16_t offset;
	char *name;
};

//#define DEFAULT_POWER_MODE	FAST_MODE
#define DEFAULT_POWER_MODE	SLOW_MODE
//#define DEFAULT_GEAR			UFS_HS_G1
#define DEFAULT_GEAR			UFS_PWM_G4
#define DEFAULT_RATE			UFS_RATE_A
#define DEFAULT_LANE			(1)
#define DEFAULT_ACTIVE_LUN	(3)
#define DEFAULT_BOOT_LUN	(0)
#pragma pack(push)
#pragma pack(1)

/*
 * Command UPIU Structure
 */
struct dwc_ufs_cmd_upiu {
	uint8_t trans_type;
	uint8_t flags;
	uint8_t lun;
	uint8_t task_tag;
	uint8_t cmd_set_type;	/* Only LS nibble is valid. Others Reserved */
	uint8_t reserved_1_0;
	uint8_t reserved_1_1;
	uint8_t reserved_1_2;
	uint8_t tot_ehs_len;
	uint8_t reserved_2;
	uint16_t data_seg_len;
	uint32_t exp_data_xfer_len;
	uint8_t cdb[16];	/* UFS/SCSI command descriptor block */
};

/*
 * Query UPIU Structure
 */
struct dwc_ufs_query_upiu {
	uint8_t trans_type;
	uint8_t flags;
	uint8_t reserved_1;
	uint8_t task_tag;
	uint8_t reserved_2;
	uint8_t query_func;
	uint8_t query_resp; /* valid only wen used for response */
	uint8_t reserved_3;
	uint8_t tot_ehs_len;
	uint8_t reserved_4;
	uint16_t data_seg_len;
	uint8_t tsf[16];
	uint32_t reserved_5;
};

/*
 * NOP OUT UPIU Structure
 */
struct dwc_ufs_nop_req_upiu {
	uint8_t trans_type;
	uint8_t flags;
	uint8_t reserved_1;
	uint8_t task_tag;
	uint32_t reserved_2;
	uint8_t tot_ehs_len;
	uint8_t reserved_3;
	uint16_t data_seg_len;
	uint8_t reserved_4[20];
};

/*
 * NOP IN UPIU Structure
 */
struct dwc_ufs_nop_resp_upiu {
	uint8_t trans_type;
	uint8_t flags;
	uint8_t reserved_1;
	uint8_t task_tag;
	uint8_t reserved_2_0;
	uint8_t reserved_2_1;
	uint8_t response;
	uint8_t reserved_3;
	uint8_t tot_ehs_len;
	uint8_t device_info;
	uint16_t data_seg_len;
	uint8_t reserved_4[20];
};

/*
 * Transfer Response UPIU Structure
 */
struct dwc_ufs_resp_upiu {
	uint8_t trans_type;
	uint8_t flags;
	uint8_t lun;
	uint8_t task_tag;
	uint8_t cmd_set_type;	/* Only LS nibble is valid. Others Reserved */
	uint8_t reserved_1;
	uint8_t response;
	uint8_t status;		/* This is SCSI status */
	uint8_t tot_ehs_len;
	uint8_t device_info;
	uint16_t data_seg_len;
	uint32_t residual_xfer_count;
	uint32_t reserved_2;
	uint32_t reserved_3;
	uint32_t reserved_4;
	uint32_t reserved_5;
	uint16_t sense_data_len;
	uint8_t sense_data[18];
};

struct dwc_ufs_prd {
	uint32_t base_addr;
	uint32_t upper_addr;
	uint32_t reserved1;
	uint32_t size;
};

/**
 * dwc_ufs_ucd
 * UTP Command Descriptor (UCD) structure.
 * Every UTRD contains a pointer for this data structure
 * This structure logically consists of 3 parts
 *	1. "Transfer Request" or "Command UPIU" (SCSI, Native UFS & DM)
 *	2. "Transfer Response" or "Response UPIU"
 *	3. "Physical Region Description Table"(PRDT).
 * The data structure should support 32 bit or 64 bit memory buffer address
 * space.
 * "Transfer Request" and "Transfer Response" are in BIG ENDIAN Format
 * "PRDT" is in LITTLE ENDIAN Format
 */
struct dwc_ufs_ucd {
	u8 cmd_upiu[DWC_UCD_ALIGN];
	u8 resp_upiu[DWC_UCD_ALIGN];
	struct dwc_ufs_prd prdt[DWC_UFSHCD_MAX_PRD_SIZE];
};

struct dwc_ufs_utrd {
	uint8_t reserved_1_0:8;
	uint8_t reserved_1_1:8;
	uint8_t reserved_1_2:8;
	uint8_t ct_and_flags:8;
	uint32_t reserved_2:32;
	uint8_t ocs:8;
	uint8_t reserved_3_0:8;
	uint8_t reserved_3_1:8;
	uint8_t reserved_3_2:8;
	uint32_t reserved_4:32;

	/* Only bits 31:7 are valid; 128B Aligned addr */
	uint32_t ucdba:32;
	uint32_t ucdbau:32;
	uint16_t resp_upiu_length:16;
	uint16_t resp_upiu_offset:16;

	uint16_t prdt_length:16;
	uint16_t prdt_offset:16;
};

/**
 * dwc_ufs_tm_req_upiu
 * Task Management Request UPIU structure
 * Size of this structure is 32 bytes
 * The data structure should support 32 bit or 64 bit memory buffer address
 * space. This structure is in BIG ENDINA Format
 */
struct dwc_ufs_tm_req_upiu {	/* BIG ENDINA */
	uint8_t trans_type;
	uint8_t flags;
	uint8_t lun;
	uint8_t task_tag;
	uint8_t reserved_1;
	uint8_t tm_fn;
	uint8_t reserved_2_0;
	uint8_t reserved_2_1;
	uint8_t tot_ehs_len;
	uint8_t reserved_3;
	uint16_t data_seg_len;
	uint32_t input_param_1;
	uint32_t input_param_2;
	uint32_t input_param_3;
	uint32_t reserved_4;
	uint32_t reserved_5;
};

/**
 * dwc_ufs_tm_resp_upiu
 * Task Management Response UPIU structure
 * Size of this structure is 32 bytes
 * The data structure should support 32 bit or 64 bit memory buffer address
 * space. This structure is in BIG ENDINA Format
 */
struct dwc_ufs_tm_resp_upiu {	/* BIG ENDINA */
	uint8_t trans_type;
	uint8_t flags;
	uint8_t lun;
	uint8_t task_tag;
	uint8_t reserved_1_0;
	uint8_t reserved_1_1;
	uint8_t response;
	uint8_t reserved_2;
	uint8_t tot_ehs_len;
	uint8_t reserved_3;
	uint16_t data_seg_len;
	uint32_t output_param_1;
	uint32_t output_param_2;
	uint32_t reserved_4;
	uint32_t reserved_5;
	uint32_t reserved_6;
};

struct dwc_ufs_utmrd {
	uint8_t reserved_1_0:8;
	uint8_t reserved_1_1:8;
	uint8_t reserved_1_2:8;
	uint8_t intr_flag:8;	/* only one bit is valid */
	uint32_t reserved_2:32;
	uint8_t ocs:8;
	uint8_t reserved_3_0:8;
	uint8_t reserved_3_1:8;
	uint8_t reserved_3_2:8;
	uint32_t reserved_4:32;

	struct dwc_ufs_tm_req_upiu tm_req_upiu;
	struct dwc_ufs_tm_resp_upiu tm_resp_upiu;
};

#pragma pack(pop)
struct para_with_enable {
	uint32_t enable;
	uint32_t value;
};

struct ufs_mode_page_para {
	struct para_with_enable tst;
	struct para_with_enable swp;
	struct para_with_enable busy_timeout_period;
	struct para_with_enable read_retry_count;
	struct para_with_enable write_retry_count;
	struct para_with_enable recovery_time_limit;
	struct para_with_enable wce;
	struct para_with_enable rcd;
};

#define CONTROL_MODE_PAGE_CODE				0x0A
#define CONTROL_MODE_PAGE_SIZE				20
#define READ_WRITE_ERROR_RECOVERY_MODE_PAGE_CODE	0x01
#define READ_WRITE_ERROR_RECOVERY_MODE_PAGE_SIZE	20
#define CACHING_MODE_PAGE_CODE				0x08
#define CACHING_MODE_PAGE_SIZE				28
#define MAX_MODE_PAGE_SIZE				28

struct partitionDesc {
	uint8_t bootLunId;
	uint8_t writeProtect;
	uint8_t memoryType;
	uint8_t dataReliability;
	uint8_t blockSize; /* bLogicalBlocksize Def: 4096 */
	uint8_t provType; /* Fully provisioning or Thin provisioning */
	uint16_t wContextCapabilities;
	/* Capacity of LUN for provisioning in Mega bytes */
	uint32_t lu_capacity;
#define UFS_MAX_LU_CAP		0xFFFFFFFF
	uint32_t dNumAllocUnits;      /* Used internally by driver */
};

struct configuration_header {
	uint8_t bBootEnable;
	uint8_t bDescrAccessEn;
	uint8_t bInitPowerMode;
	uint8_t bHighPriorityLUN;
	uint8_t bSecureRemovalType;
	uint8_t bInitActiveICCLevel;
	uint16_t wPeriodicRTCUpdate;
};

struct partitionDescTable {
	uint8_t bNumberLU;            /* Used internally by driver */
	uint8_t bAllocationUnitSize;  /* Used internally by driver */
	uint32_t dSegmentSize;        /* used internally by driver */
	uint64_t qTotalRawDeviceCapacity;
	uint8_t bDataOrdering;
	uint8_t bMaxContexIDNumber;
	uint16_t wSupportedMemoryTypes;
	uint32_t dSystemCodeMaxNAllocU;
	uint16_t wSystemCodeCapAdjFac;
	uint32_t dNonPersistMaxNAllocU;
	uint16_t wNonPersistCapAdjFac;
	uint32_t dEnhanced1MaxNAllocU;
	uint16_t wEnhanced1CapAdjFac;
	uint32_t dEnhanced2MaxNAllocU;
	uint16_t wEnhanced2CapAdjFac;
	uint32_t dEnhanced3MaxNAllocU;
	uint16_t wEnhanced3CapAdjFac;
	uint32_t dEnhanced4MaxNAllocU;
	uint16_t wEnhanced4CapAdjFac;
	struct configuration_header *p_conf_header;
	struct partitionDesc *partitionDescPtr[8];
};

struct desc_params {
	void                 *req_upiu;
	struct configuration_header *conf_head;
	struct partitionDesc **part_desc;
	uint8_t              opcode;
	uint8_t              desc_idn;
	uint8_t              desc_index;
	uint16_t             length;
};

/* UFS: Device descriptor */
struct ufs_device_descriptor {
	uint8_t  bLength;
	uint8_t  bDescriptorType;
	uint8_t bDevice ;/*Device*/
	uint8_t bDeviceClass ;/*00h 00h: Mass Storage*/
	uint8_t bDeviceSubClass ;/*00h 00h: Embedded Bootable*/
	uint8_t bProtocol ;/*00h 00h: SCSI*/
	uint8_t bNumberLU; /*User Conf. Number of Logical Units (Default: 00h)*/
	uint8_t bNumberWLU; /*04h 04h: 4 Well known logical units exist*/
	uint8_t bBootEnable; /*User Conf. 00h: Boot feature disabled (Default) 01h: Bootable feature enabled*/
	uint8_t bDescrAccessEn; /*User Conf. 00h: Device Descriptor access disabled (Default) 01h: Device Descriptor access enabled*/
	uint8_t bInitPowerMode; /*User Conf. 00h: UFS-Sleep Mode 01h: Active Mode (Default)*/
	uint8_t bHighPriorityLUN; /*User Conf. 00h-07h: Configured LUN has high priority 7Fh: All logical units have the same priority (Default)*/
	uint8_t bSecureRemovalType;
	uint8_t bSecurityLU; /*01h 01h: RPMB*/
	uint8_t bBackgroundOpsTermLat;
	uint8_t bInitActiveICCLevel;
	uint16_t wSpecVersion; /*0210h Specification version 2.10*/
	uint16_t wManufactureDate; /*Device Specific Manufacturing Date ex: 0515h = May 2015 Rev 1.2 / Aug. 2016 33 OFFSET SIZE NAME VALUE Description*/
	uint8_t iManufacturerName; /*01h Index to Manufacturer Name String*/
	uint8_t iProductName; /*02h Index to Product Name String*/
	uint8_t iSerialNumber; /*03h Index to Serial Number String*/
	uint8_t iOemID; /*04h Index to OEM ID String*/
	uint16_t wManufacturerID; /*1ADh Manufacturer ID*/
	uint8_t bUD0BaseOffset; /*10h Unit Descriptor 0 Base Offset*/
	uint8_t bUDConfigPLength;
	uint8_t bDeviceRTTCap;
	uint16_t wPeriodicRTCUpdate; /*User Conf. Frequency and method of Real-Time Clock update (Default 000h)*/
	uint8_t bUFSFeatureSupport; /*01h 01h: Field Firmware Update (FFU) supported*/
	uint8_t bFFUTimeout; /*03h Field Firmware Update Timeout. The maximum time is expressed in unitsof seconds.*/
	uint8_t bQueueDepth; /*00h 0: The device implements the per-LU queueing architecture.22h 2 wDeviceVersion 00h Device version*/
	uint16_t wDeviceVersion;
	uint8_t bNumSecureWPArea; /*20h Number of Secure Write Protect Areas*/
	uint32_t dPSAMaxDataSize; /*00h PSA Maximum Data Size*/
	uint8_t bPSAStateTimeout; /*00h PSA State Timeout*/
	uint8_t iProductRevisionLevel; /*05h Index to the string which contains the Product Revision Level*/
	uint8_t Reserved[5]; /*00h Reserved*/
	uint8_t ReservedUME[16]; /*00h Reserved for Unified Memory Extension standard*/
}__attribute__ ((packed));
/* UFS: Device descriptor */
struct ufs_geometry_descriptor {
	uint8_t bLength;
	uint8_t bDescriptorType;
	uint8_t bMediaTechnology;
	uint8_t Reserved;
	uint64_t qTotalRawDeviceCapacity;
	uint8_t bMaxNumberLU;
	uint32_t dSegmentSize;
	uint8_t bAllocationUnitSize;
	uint8_t bMinAddrBlockSize;
	uint8_t bOptimalReadBlockSize;
	uint8_t bOptimalWriteBlockSize;
	uint8_t bMaxInBufferSize;
	uint8_t bMaxOutBufferSize;
	uint8_t bRPMB_ReadWriteSize;
	uint8_t bDynamicCapacityResourcePolicy;
	uint8_t bDataOrdering;
	uint8_t bMaxContexIDNumber;
	uint8_t bSysDataTagUnitSize;
	uint8_t bSysDataTagResSize;
	uint8_t bSupportedSecRTypes;
	uint16_t wSupportedMemoryTypes;
	uint32_t dSystemCodeMaxNAllocU;
	uint16_t wSystemCodeCapAdjFac;
	uint32_t dNonPersistMaxNAllocU;
	uint16_t wNonPersistCapAdjFac;
	uint32_t dEnhanced1MaxNAllocU;
	uint16_t wEnhanced1CapAdjFac;
	uint32_t dEnhanced2MaxNAllocU;
